In [190]:
import pandas as pd 
students =  {"Corey": [63,75,88], "Kevin": [48,98,92], "Akshay": [87,86,85]}

#convert dictionary to pandas.DataFrame 

df = pd.DataFrame(students)
df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [191]:
#arange the rows _ limit the data frame for the first two rows

df[0:2]

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86

In [192]:
#transpose the DataFrame
df =df.T
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [193]:
#rename the colums 1-3
df.columns =["Quiz1", "Quiz2", "Quiz3"]
df

        Quiz1  Quiz2  Quiz3
Corey      63     75     88
Kevin      48     98     92
Akshay     87     86     85

In [194]:
#defining of a new DataFrame for the first two rows 
new_df = df.iloc[0:2]
new_df

       Quiz1  Quiz2  Quiz3
Corey     63     75     88
Kevin     48     98     92

In [195]:
#TO ABOVE: slicing 
#and last two colums with index numbers



super_new = new_df.iloc[:, [1,2]]
super_new

       Quiz2  Quiz3
Corey     75     88
Kevin     98     92

In [196]:
#in one go
df.iloc[:2,1:]

#or 
df.iloc[0:2,1:3]

       Quiz2  Quiz3
Corey     75     88
Kevin     98     92

In [197]:
#or with index numbers 
df.iloc[[0,1],[1,2]]

       Quiz2  Quiz3
Corey     75     88
Kevin     98     92

In [223]:
#OR with keywords

rows = ["Corey", "Kevin"]
cols = ["Quiz2", "Quiz3"]
df_spring = df. loc [rows, cols]
df_spring

       Quiz2  Quiz3
Corey     75     88
Kevin     98     92

In [224]:
#add a new column with mean 
df_spring["Quiz_Average "] =df_spring.mean(axis= 1)
df_spring

       Quiz2  Quiz3  Quiz_Average
Corey     75     88           81.5
Kevin     98     92           95.0

In [225]:
#add new column by mentioning name
df_spring ["Quiz4"] = [22,33]
df_spring

       Quiz2  Quiz3  Quiz_Average   Quiz4
Corey     75     88           81.5     22
Kevin     98     92           95.0     33

In [226]:
#delete columns
del df_spring["Quiz_Average "]
df_spring

       Quiz2  Quiz3  Quiz4
Corey     75     88     22
Kevin     98     92     33